Revit 2027 API
ExternalDataManagerTool(ExternalDataManagerCommandId) Constructor
 Constructor
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExternalDataManagerTool(
	ExternalDataManagerCommandId commandId
)
Public Sub New (
	commandId As ExternalDataManagerCommandId
)
public:
ExternalDataManagerTool(
	ExternalDataManagerCommandId^ commandId
)
new :
        commandId : ExternalDataManagerCommandId -> ExternalDataManagerTool
Parameters
commandId ExternalDataManagerCommandId
 The command id of the tool.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExternalDataManagerTool Class
ExternalDataManagerTool Overload
Autodesk.Revit.UI Namespace